# Removing Missing data

In [3]:
import pandas as pd
import numpy as np

In [ ]:
# Imported the data in csv format 
data = {
    "Name": ["Amit", "Neha", "Ravi", "Pooja", None],
    "Age": [20, 21, np.nan, 22, 23],
    "Marks": [85, np.nan, 78, None, 90],
    "City": ["Delhi", "Mumbai", None, "Pune", "Bangalore"]
}
df = pd.DataFrame(data)

# Display the first few rows of the DataFrame
df.head()

# info about the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      float64
 2   Marks   3 non-null      float64
 3   City    4 non-null      object
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes

In [5]:
# Remopving rows with missing values
df.dropna() # This will remove all rows that contain at least one missing value

   Name   Age  Marks   City
0  Amit  20.0   85.0  Delhi

In [ ]:
 # removing rows based on specific column
df.dropna(subset=['Age']) # This will remove rows where the 'Age' column has missing values

    Name   Age  Marks       City
0   Amit  20.0   85.0      Delhi
1   Neha  21.0    NaN     Mumbai
3  Pooja  22.0    NaN       Pune
4   None  23.0   90.0  Bangalore

In [7]:
# Removing rows only if all values are missing
df.dropna(how='all') # This will remove rows where all values are missing

    Name   Age  Marks       City
0   Amit  20.0   85.0      Delhi
1   Neha  21.0    NaN     Mumbai
2   Ravi   NaN   78.0       None
3  Pooja  22.0    NaN       Pune
4   None  23.0   90.0  Bangalore